{"name":"N T","email":"orangekid@gmail.com","phone":"703-362-2566","profiles":"linkedin.com/in/johntwong","summary":"OF EXPERTISE\nOver 15 years of domestic/international leadership, strategy and digital marketing experience with 10 years managing P&L for eCommerce/mobile startups and retailers selling products and subscription SAAS\nLead 15 member teams in successfully marketing data-driven social media (Facebook, Twitter, G+, Pinterest, Instagram, LinkedIn, YouTube), SEO/content strategy, SEM/AdWords/Display/PLA/Re-Marketing ($4.5M+ budget), Amazon ($2.1M sales), email (2M addresses), affiliate marketing (80k affiliates) and others comprising programmatic, traditional, trade, loyalty and brand marketing for B2C and B2B\nPerformed UI/UX optimization, A/B/multivariate testing, optimized sales funnel, set up lead generation and automated/ programmatic triggered emails raising sales conversion (28%) throughout customer journey cycle\nIncreased KPIs - AOV (72%), ARPU (2.2x), customer LTV (3x), etc. for subscription-based service\nConducted quantitative analysis utilizing tools such as Google Analytics, Omniture, HubSpot, Optimizely, CrazyEgg, Flurry, PowerBI, social media analytics and others on testing/meeting key metrics\nGenerated sales for startups on limited budget with no funding to $3M in 2 years, and have grown medium-sized eCommerce operations to 1.8x and to $40M+; and responsibility of 35 team members\nInstituted omni-channel marketing, strategized market entry, planned integrated 360° campaigns\nProduced project scopes and managed development of proprietary shopping carts and eCommerce platforms -Magento, Intershop, Drupal/Ubercart, Wordpress, BigCommerce, etc. as well as iOS/Android apps\nCAREER CHRONOLOGY\nConsultant Digital/Consumer Marketing Remote (5/17 - Present)\nPlan, strategize and brand Korean company's 3 finger disposable glove for food chains and retail markets. Set up, strategize and market China manufacturer of wooden toys into US marketplaces -Amazon, eBay, Jet, Walmart, etc.\nSenior Director of eCommerce, LightingNewYork.com Selinsgrove, PA/NYC (11/15-2/17)\nLightingNewYork is the top eCommerce retailer in luxury lighting and home decor industry. Company sold.\nLead and mentored to 5 department director heads: Marketing, SEM, Data, Logistics and Customer Service. Instituted organizational changes in systems/processes. Strategized/planned (50%) and hands-on contributed (50%) to over 20% growth overall from 2016-2017 in email, direct mail, content/social, marketplace, loyalty and B2B. Held P&L responsibilities. Completed John Maxwell Leadership coaching.\nDirector Digital Marketing (Contract) Princeton, NJ (8/15-11/15)\nPrinceton Partners Inc.\nPrinceton Partners is a traditional/digital marketing advertising agency.\nSpecifically tasked to provide strategy and digital marketing and technical management of physical education online video program initiative sponsored by Johnson & Johnson and Microsoft combating obesity and improving academic performance in kids from K-K5 public/private schools. https://activityworks.com/\nDirector Consumer/Digital Marketing (Contract) Westampton, NJ (9/14-3/15)\nParis Corporation / Weego\nParis Corporation's consumer electronics brand, Weego, offers battery packs and compact lithium battery jump-starters that are sold through distributors and mass online/chain stores.\nRestructured consumer/digital marketing department for internal startup, Weego. Built and lead team. Re-launched website and contextual marketing, systematized marketing collateral, enlisted and managed agency and PR firm for trade marketing. Won Global Media and TWICE Picks awards at CES and SEMA.\nCo-Founder/Director of Digital Marketing, GoIDD LLC Fountain Valley, CA (5/12-2/14)\nGoIDD is a B2C mobile VOIP telecommunications SAAS provider offering international calling and SMS through iPhone/iPad and Android phone/tablets targeting Hispanic & Asia Pacific market. Company sold.\nSpearheaded UI/UX optimization of eCommerce and backend customer/admin dashboard, and iOS and Android apps. Strategized service pricing plans, VAS offerings and referral/affiliate programs. Validated product market fit through Lean Startup/Agile methodologies via mobile/Internet ad partner through SEM, PPI, etc. Increased KPIs such as sales conversions (28%), AOV (72%), ARPU (2.2x), customer LTV (3x), etc. Propelled customer growth by 3.4x in 3 months with group buying promotions -Groupon HK, DealGuru, etc.\nFounder/Head of Strategy & Accounts, Red-Robots Ltd Wanchai, Hong Kong (5/10-4/13)\nRed-Robots is a Hong Kong based Entertainment Licensing Consultancy offering Brand Licensing, Asia Video Game Distribution and Pre-Production Services focused on technology sector.\nLead pre-sales and account management of product launches and channel/integrated marketing campaigns for clients like HP China, Nokia and others in mobile/PC space. Licenses included movie Kung-Fu Panda 2, mobile games Angry Birds and Fruit Ninja, and Japanese Anime. Acquired and distributed digital content comprising of trailers, movies, music, games, apps, etc. via micro SD cards/USB and mobile marketplaces. Employed DRM and SMS payment solutions. Sold 3 million dollar projects.\n(Contract) License Category Director, OSM Global - OSM Global is a Swedish company (1,400 employees, 14 offices worldwide) providing case solutions for mobile, computing, camera and healthcare sectors. Attained major licenses for clients Samsung, Lenovo, Canon and others. Properties included fashion brand Paul Frank, publisher Lonely Planet, movie Tron Legacy, musician Lady Gaga and more. Achieved the highest sell-through of 3 flagship laptops in 2011 with Kung-Fu Panda 2 X HP China program.\nDirector of Ecommerce, Action-HQ Ltd Tsuen Wan, Hong Kong (10/02-12/09)\nAction-HQ is a B2C online niche retailer in collectibles, toys, videos and video games with 6,000+ products.\nSet up infrastructure and eCommerce site utilizing osCommerce, later migrating to Magento. Grew sales through SEO, SEM, email marketing, CRM, contextual advertising, affiliate programs, guerrilla marketing, loyalty, social media, etc. Achieved revenues of niche retailer to USD3m in 2 years with no funding.\nHead of Strategy & Sales, PopBox Collectibles Ltd, Tsuen Wan, Hong Kong (4/04-11/09) - Sister company, PopBox, is a licensing and product development house producing and distributing high-end collectibles and toys. Analyzed, negotiated and procured licenses, and marketed consumer merchandise worldwide to distributors and licensees. Created promotional premiums for LG, Kellogg's and others. Licenses included Marvel, The Dark Knight, Transformers Revenge of the Fallen and more. Protracted life-cycle of 3 phone models from 3-4 to 12-16 months increasing sales 3X with Transformers X Nokia project.\nCo-Founder/COO/SVP Product Development\nActionAce.com, Inc. (A2) Wanchai, Hong Kong & Richmond (SF), CA (06/96-01/01)\nA2 was the ultimate pop-culture entertainment portal with commerce/content/community. Website had 3,000+ products; 4 online magazines; Flash-animated cartoon series and 30+ discussion boards/chats. Top Asian VC firms AsiaTech Ventures, ING Barings Private Equity and PCCW were investors. Company sold.\nAs Co-Founder/COO (12/96-10/99), set up and managed company with 12 employees in Hong Kong to 130 employees at 50,000 sq. ft. office/warehouse in US. As SVP Product Development (11/99-6/01), initiated projects in licensing and distribution of A2's product line. Executed in development of systems including conversion from Intershop to Blue Martini, Oracle financial, EDI, BeFree affiliate program, enCompass CMS, Cybersource payment transaction, fully-integrated fulfillment center, 7-day week customer service center and sizable marketing campaigns with top tier websites like AOL, GeoCities, Yahoo and others.\nCONSULTANT, TEMPORARY PROJECTS\nStrategist/Digital Marketing, OriginalsU Ltd Tsuen Wan, Hong Kong (12/12-3/13)\nArchitected UX/UI optimization of Social eCommerce Platform utilizing Drupal/Ubercart and comprising of WYSIWYG functions, automated social tools and 2 layer seller/affiliate commission system.\nStrategist, ADFusion Asia Ltd Beijing, China (6/06-10/07)\nDeveloped strategy for B2B lead generation company for automotive and insurance industry; negotiated winning advertising/revenue-share contracts with Yahoo, Tom.com, China.com, Sohu.com and Sina.com.","projects":"Strategist/Digital Marketing, OriginalsU Ltd Tsuen Wan, Hong Kong (12/12-3/13)\nArchitected UX/UI optimization of Social eCommerce Platform utilizing Drupal/Ubercart and comprising of WYSIWYG functions, automated social tools and 2 layer seller/affiliate commission system.\nStrategist, ADFusion Asia Ltd Beijing, China (6/06-10/07)\nDeveloped strategy for B2B lead generation company for automotive and insurance industry; negotiated winning advertising/revenue-share contracts with Yahoo, Tom.com, China.com, Sohu.com and Sina.com.","education":"George Mason University, Fairfax, Virginia, USA\nB.A. International Studies 1992, 3.7 GPA. Comparative studies and practices in business, economics, government and statistics. Acquired skills to systematically research, analyze and present programs."}