{"name":"Experience\nI","email":"in@who.eop.gov","phone":"(917) 238-6656","experience":"INTERN, WHITE HOUSE INFORMATION TECHNOLOGY, EXECUTIVE OFFICE OF THE PRESIDENT ; WASHINGTON, DC —\nSEPTEMBER 2015 - FEBRUARY 2016\nDeveloped a PowerShell script and assisted with integrated it with Microsoft Service Center Operations\nManager to add additional monitoring capabilities for a major application used by White House staff.\nAttended sprint planning and design meetings.\nResearched and proposed improvements, in the form of custom plugins, to the internal ticketing system\nused by White House Information Technology.\nSOFTWARE DEVELOPER, OFFICE OF TECHNOLOGY SERVICES AT GWU; WASHINGTON, DC — MAY 2015 - PRESENT\nLed software development, responsible for a variety of projects such as:\nDeveloping a Loan request system integrated with the ServiceNow database that allows members of the\nColumbian College (At GWU) to view and request assets available for Loan.\nDeveloped a Web based appointment scheduler for faculty members to reserver an available time slot\nto upgrade their work station.\nDeveloped a VPN manager in Swift for OS X that allows users to connect to VPN and mount their\nresearch drives with just one click.\nBuilt the framework of a Self Service portal that allows users log into and manage their departments\ncreated incidents and hardware assets, stored within the underlying ServiceNow database.","education":"The George Washington University, Washington, DC - BS Computer Science, Minor Business\nAdministration, 2018 - GPA 3.55 (Cumulative through 12/9/2015)\nMoravian Academy, Bethlehem, Pennsylvania - 2014","skills":"Pro cent in: Java, C, javascript, HTML, Git, Unix, ServiceNow\nFamiliar with: Swift, Python, Powershell, SalesForce\nReferences\nAustin Lin, Associate Director for Technology, White House Information Technology,\nAustin_Y_Lin@who.eop.gov\nTony Haile, CEO Chartbeat Inc., New York, New York, (917) 238-6656, tony@chartbeat.com\nRandall Shore, Director of The Of ce of Technology Services at GWU, (202) 436-1506,\nrandy_s@email.gwu.edu\nAlexander Maloney\n(610) 533-4832 maloney.a12@gmail.com"}