{"name":"Hao Wen","email":"zachwen@gwu.edu","phone":"(202) 746-6229","profiles":"www.linkedin.com/in/wenhaozach","education":"George Washington University, School of Engineering and Applied Science Washington, DC\nMaster of Science in Engineering, Computer Science May 2017\nRelevant Coursework: Software Paradigm, Computer Architecture, Algorithm\nRenmin University of China Beijing, China\nBachelor of Science in Engineering, Computer Science and Technology June 2015\nRenmin University ranked among the top 5 universities in China","experience":"Multimedia Lab, Renmin University of China Beijing, China\nLead Researcher November 2014 – May 2015\nDeveloped an Android program to collect information from GPS and gravity sensors for pattern recognition and\nnavigation indoors using Java, MATLAB and MySQL.\nDesigned 8 standard paradigms of user behavior such as standing still, walking, turning, running, etc. and built\ndatabase using data collected from 9 volunteers exhibiting these behaviors.\nBuilt 27 dimension vector features and then applied machine learning to recognize behaviors.\nLab of Economic Information System, Renmin University of China Beijing, China\nTeam member May 2013 - February 2015\nTrained in data mining software and concepts of multi-objective decisions.\nCollated expense data from people who purchased items from Jingdong, an online store, and conducted an analysis to\ndetermine the relationship between users and products as well as product relationships with other products.\nCollated expense calendar on products from sponsor and conducted simulation based on it.\nConducted clustering and classification strategies on products using Java and Weka.\nCommunicated applications and reports with members, and presented to professionals.\nInternational Business Machines Corporation Beijing, China\nIntern October 2013 - November 2013\nDesigned a simple program data structure to imitate the company's actual database using C Language for software\ndevelopment in compliance with company standards.\nCoached on the company's management application software.\nContemporary Undergraduate Mathematical Contest in Modeling Beijing, China\nTeam member (undergraduate group) September 2013\nDesigned a traffic flow model to predict various traffic flow situations and effective factors following a car crash.\nSimulated traffic jams using Java and VISSIM, and made tables and graphs using MATLAB and R to describe effect\nfactors and their influences on traffic jams.\nCompleted paper with two classmates providing an analysis for micro and macro models and three simulations.\nLEADERSHIP\nVice President of Detective Club of Renmin University (focused on critical thinking & reasoning) Sept 2011 – May 2014\nVice Director of Computer Association of Renmin University Sept 2011 – May 2013","awards":"Awarded First Prize, University Students' Innovation Practice of China (City Level), May 2015\nNational First Prize, Contemporary Mathematical Contest in Modeling (Top 1%), September 2013\nFirst Class Scholarship, Awarded by Sa Shixuan Fund (Top 5%), December 2013","honors":"& AWARDS\nAwarded First Prize, University Students' Innovation Practice of China (City Level), May 2015\nNational First Prize, Contemporary Mathematical Contest in Modeling (Top 1%), September 2013\nFirst Class Scholarship, Awarded by Sa Shixuan Fund (Top 5%), December 2013","skills":"Programming Language: Java, C, C++, MATLAB, SQL, Erlang, Scala, Python\nApplications: Microsoft Office Sets, MySQL, Microsoft Visual Studio, Eclipse, Adobe Photoshop, Corel VideoStudio\nOperating Systems: Linux, Windows\nLanguage: Fluent in Chinese, Proficient in English"}