{"name":"L R","email":"mic.richa@gmail.com","phone":"(310) 614-3109","education":"The George Washington University, School of Business Washington, DC\nMaster of Business Administration (MBA) Exp. 2019\nCertificates: Digital Marketing Communications, Marketing & Brand Management Exp. 2018\nIndiana University, Kelley School of Business Bloomington, IN\nBachelor of Science in Business Marketing, Minor: History of Art May 2008\nInstitute for the International Education of Students Dublin, Ireland\nAreas of Study: Economics, International Politics Summer 2006","experience":"United Way Worldwide Alexandria, VA\nDirector, Product Marketing Jan. 2018 – Present\nResponsible for developing and implementing comprehensive product marketing strategies and tactics to drive adoption of\nUnited Way Worldwide (UWW) social impact products within corporate partners and across the United Way Network.\nFacilitate corporate partner engagement of their employees to enrich their experience by giving back.\nLead product marketing efforts, incl. Salesforce.org Philanthropy Cloud partnership to revolutionize social giving and\nredefine the future of corporate giving, MyFreeTaxes, SalaryFinance, Generation, Mission United, 2-1-1, etc.\nCross-functionally design, develop, test, launch, and evaluate UWW social impact products for domestic and\ninternational markets; in addition, support the design of products based upon established innovations, solutions and\ninitiatives that accelerate and improve United Way Network performance.\nWork side-by-side with sales team to develop resources and engage enterprise-level buyers of impact products.\nOperationalize go-to-market strategies for United Way products to maximize local adoption and individual engagement\nacross the United Way Network, using Salesforce CRM software; developed metrics of success for accountability.\nManager, Digital Programs Apr. 2016 – Dec. 2017\nManaged digital programs to create individual donor experiences and to highlight stories that build on our mission to fight for\nthe health, education and financial stability of every person in every community.\nLed strategic planning, marketing, sales and launch of social impact products.\nDirected the development, execution, and promotion of digital programming, specifically with The Hero Effect—a\ntelevision/digital series that raised awareness of local initiatives and fostered individual engagement opportunities.\nWorked alongside production partner, Dolphin Entertainment, to co-lead and co-decide all things related to The Hero\nEffect, supporting United Way's interests and values; garnered approximately one million unique viewers, not\nincluding DVR or digital views, with high performance among millennials.\nCreated marketing communications plans, incl. social media, public relations, internal and external network comms.\nLed story development, on-site production, editorial feedback, ancillary content creation, and website development.\nProduced stage presentation and panel discussion for executive team to announce program at worldwide conference.\nRhythm & Hues Los Angeles, CA\nProducer Dec. 2014 – Apr. 2016\nReturned to lead loyal company rebuild, orchestrating all production and content-driven marketing efforts as the principal\nclient contact for projects, incl.: Skull Island: Reign of Kong, Game of Thrones, and The Walking Dead.\nHarmonized numerous departments by advocating technical approach for first-time theme park production with\ndecade-long tenure, meeting ambitious milestones under accelerated schedule and fixed budget.\nChampioned campaign to restructure communication pipeline with new parent company by aligning internal executive\npriorities with client, thus alleviating 50% of processing time/cost and strengthening partnerships.\nProgram Coordinator Dec. 2009 – May 2012\nProduced across multiple departments, leading teams of up to 57 creatives on multimillion dollar properties, incl.: Life of Pi,\nMr. Popper's Penguins, Hop, and Charlie St. Cloud.\nSupervised multifaceted budgets based on scope, schedule, and resource allocation, with actuals averaging 18% below\ninitial cost estimates, while also absorbing up to 35% more work than initially awarded.\nStreamlined production efficiency for studio of 1,000+, enabling personally-managed teams to establish new industry\nstandards that resulted in unanimous accolades and the Academy Award, Visual Effects.\nTrained and on-boarded 20+ coordinators over 4 concurrent projects with crews of 521+ to address scope increases.\nCreated, staffed and managed two new departments as the gateway for 15 global, cross-functional teams.\n2\nScarecrow VFX Los Angeles, CA\nProgram Manager Apr. 2014 – Dec. 2014\nLaunched world's first cloud-based visual effects company via local value-based positioning in transient digital industry.\nEstablished roadmap with supporting business plans to ensure consistent corporate growth and innovation; incl.\npartnering with the Sundance Institute and building a more user-friendly website/platform experience.\nDesigned multi-channeled platform for clients, creatives, and production, integrating website with innovative asset and\ncommunication system to cut overhead costs by up to 50% through remote-based workflow.\nServed as acting producer to bid future projects, assign resources, assess risk, and track fluid budgets for small to large-\nscale projects, reducing labor costs through efficient cross-functional team management on concurrent projects.\nPresented strategic recommendations on how to enhance the company's value proposition by creating user-friendly\ndata management and analytics tools.\nGenerated new business on 3 projects by identifying industry influencers, personal selling through pitch presentations,\nmedia outreach, consumer base retention of 650+ creatives and businesses, and demonstrating how our innovations\nallow us to provide local support while staying fiscally competitive.\nEstablished best practices and quality assurance for MPAA compliance to qualify for studio-level work (e.g., Warner\nBros.).\nDeveloped unique strategies to target wide range of potential clients, creating messages to support each through diverse\ncommunications channels, incl. website copy, social media engagement, consumer outreach, and internal messaging.\nThe Walt Disney Company Los Angeles, CA\nProgram Coordinator Sept. 2013 – Apr. 2014\nCreated ambitious \"Disney experience\" centered on the $180M franchise film production, Maleficent.\nCollaborated with President of Film Production and executives (e.g., Angelina Jolie) to establish creative strategy for a\nreimagined property, far-exceeding box office expectations as the 4th highest-grossing film of 2014.\nDirected 5 global vendors' daily operations alongside internal teams by communicating vision against calculated\nschedule and budget, authoring creative feedback on 10,000 shot versions for film and marketing.\nAligned domestic/worldwide production and marketing initiatives to Disney's corporate values, identifying\nopportunities for distinction through style guides, focus groups, creative storytelling, and cross-selling.\nDigital Domain Los Angeles, CA\nGlobal Vendor Coordinator July 2012 – June 2013\nOrchestrated activities and aligned business objectives amongst external vendors, studio clients, and internal departments to\nsuccessfully meet tightly-budgeted deadlines for several $100M properties, incl. the pioneering co-production, Ender's Game.\nActing producer and strategist for 5 global vendors, serving creative development, best practices, staff resources, and\non-boarding of 8 international companies.\nExpanded the Global Outsource unit through the creation of an enhanced communication pipeline and an automated\nasset delivery system, enabling company to outsource nearly 30% of contracted work and reduce labor costs.\nManeuvered through corporate bankruptcy and resurgence, coordinating vendors via crisis communication as core\nrelationship manager without losing their services or client trust, and still delivering on time.\nAnalyzed and interpreted weekly production costs and task completion rates, and advised on optimization of resources\nthat ultimately delivered above target margin.\nFreelance Media Production Apr. 2008 – Dec. 2009\nProduced media across diverse landscape for clients, incl.: ABC, The CW, Disney, Bravo, TLC, & Discovery.\nCultivated experience without initial contacts in all stages of project development (pre-, post-, on-site), incl. 5\nindependent features, 3 short films, 9 TV shows, 1 TV special, and 1 digital show.\nCoordinated innovative digital ventures (e.g., Disney XD) with an emphasis on story development, budgeting, field\nproducing, digital post-production, and promotional campaigns.\nPMK BNC (Formerly PMK/HBH) New York, NY\nBrands, Talent, and Events Intern May 2007 – Aug. 2007\nAligned company's divisional goals to maximize exposure of A-list talent and global brands, incl.: Lars and the Real Girl,\nCharlie Bartlett, Gossip Girl, Tony Awards, and Ripley's Believe It Or Not (200M media impressions).\nMobilized campaigns by merging large-scale event production and strategic publicity, one with American Express that\ngenerated $2M in funding to provide 3.5M people in Africa with safe water."}