{"name":"Sid Kumar","email":"sidkumar9_gkf@indeedemail.com","phone":"(213) 361-1586","experience":"Product Marketing, Business Development and Sales\nDat Mobile Solutions - Los Angeles, CA - 2016 - Present\nDeveloped and executed sales, marketing and business development strategy for startup's cloud-based mobile\napplication.\n〓 Performed market sizing, competitive analysis and product positioning to differentiate Dat Mobile's SaaS\nproduct.\n〓 Developed presentations and supporting sales material to clearly articulate product value proposition.\n〓 Collaborated with marketing team to rebrand website and prepared marketing collateral to increase brand\nawareness.\n〓 Researched businesses within the environmental health and safety verticals for market development and\nrevenue\ngeneration, resulting in 3 successful on-boarded clients and 4 undergoing beta-testing.\n〓 Identified a strategic partner within the safety vertical to gain subject matter expertise and develop a\ncorresponding\ninspection solution. Established sales processes, scripts, qualification criteria and negotiation tactics to help\nclose\nmore sales deals.\n〓 Managed leads of initial business relationships obtained through phone/emails and built sales pipeline using\nCRM.\n〓 Analyzed customer data to identify key decision makers, sale patterns and unlock sales opportunities.\n〓 Conducted discovery calls, web demos with prospects and targeted customers. Understood their business\nmodel,\nchallenges and presented company's mobile system as a consultative solution to align with their needs.\n〓 Assisted CEO in preparing investor presentations and reviewing RFP's.\n〓 Planned and attended conferences, trade shows and networking events to promote product and generate\nwarm leads.\n〓 Led and drove the sales cycle of all assigned sales opportunities from initial prospect communication\nthrough\ncontract execution.\nB2B Sales Analytics and Marketing Intern\nHartwell Corporation - Los Angeles, CA - 2015-06 - 2015-08\nDeveloped and launched a new e-commerce digital channel for the company as part of its go-to-market strategy\nto expand its\nmarket share, generate new business and introduce value added products for B2B clients.\nCollaborated with customer service and marketing teams to build company's new e-commerce website and\ndrive\ncorporate brand identity; 5 out of 10 suggestions were approved by the management for final implementation.\nCreated competitive analysis, performed data mining and assessed market position in order to establish\ncompany's\nleadership in the aircraft spare parts industry.\nLed the development of excel based sales tools and models and generated sales history reports for the last\n5 years in\nExcel dashboard; improving readability and helping sales team identify sales trend easily.\nSenior Technical Analyst\nGoldman Sachs & Co - New York, NY - 2008 - 2014\nLaunched new tools in the software testing environment to reduce testing effort, increase team productivity\nand drive usage of new products.\nManaged software testing of trading products on multiple projects for a team of 30 application developers.\nPartnered with development team to enhance automation framework and reduce software release time by\n40%.\nExecuted test marketing strategy by promoting the benefits of the newly built products to various internal\ntechnology teams; 3 out of 5 development teams adopted our products to assist in their testing process.\nPerformed competitor analysis on similar products, monitored trends in financial services industry and\ngathered\ninsights in order to make strategic recommendations for new product launch.\nInitiated and developed test metrics to track, manage and compare quarterly performance of team.","education":"Master of Business Administration in Marketing\nUniversity of Southern California, Marshall School of Business - Los Angeles, CA\n2016-05\nMaster of Science in Computer Science\nUniversity of Southern California, Viterbi School of Engineering - Los Angeles, CA\n2008-05"}