{"name":"Meiraj Haq","email":"meirajhaq@gmail.com","phone":"(571)594-0186","education":"NewYork Film Academy\n4-Week Multimedia Journalism Course (January 2017)\nGeorge Mason University, Fairfax, VA\nBachelors of Science in Public Administration (December 2016)\nHudson valley community college\nAssociate Degree in Public Administration (December 2014)\nAssociate Degree in Applied Sciences (December 2014)","experience":":\nDigital Media Consultant\nATV, Islamabad, Pakistan (April 2017 – December 2017)\nWorked with the Executive Director of the company to revamp digital content creation strategies.\nCollaborated closely with the Communications/Marketing team and provided technical guidance for content creation via social media.\nWorked with the Marketing delivery team to define project plans and timeline for each campaign.\nGave presentations to company executives on utilizing Facebook, Twitter and Instagram resulting in further development of company social media involvement.\nMulti-media Journalist\nNewyork film academy, NY (January 2017 – March 2017)\nGenerated story pitches and participated in editorial process from start to end to ensure timely, accurate coverage of key local and international events.\nProduced a bi-weekly news show, demonstrating coherent organizational skill, enabling to perform in a professional environment.\nDemonstrated knowledge and successfully followed protocols for a live- to- tape TV Studio Production. This includes effective communication and collaboration with studio personnel and talent, proper distribution of scripts and rundowns, and ability to manage revisions in the show.","skills":"Creating Content: In-depth knowledge of digital video cameras (Cannon c-300, Cannon 5D mkii), Ability to write and pre-visualize news and new media projects, In-depth knowledge of ENG (Electronic News Gathering) and SEO (Search engine optimization), In-depth experience working as director, producer, technical director, director of photography, camera person, sound engineer and gaffer.\nSoftware: Avid Media composer, Final Cut Pro, Adobe Premiere, Microsoft Word, Excel, PowerPoint, Access\nOperating Systems: Windows, Mac OS\nDevelopment Tools: Basic Understanding of QTP and VB Scripting, Extensive knowledge of IBM SPSS predictive analytics software used for Statistical analysis and reporting, predictive modeling and decision management.\nCoursework and Projects\nData Analysis Research: Analyzed data about public and the private sectors using SPSS software. Generated research questions and developed investigative strategies to explain political phenomenon. Constructed tables and graphics that summarized aggregated data, illustrated variation, and drew inferences from samples to populations.\nBudgeting and Finance Project: Analyzed and presented State and municipal governmental budgets with special emphasis on reforms, processes, revenues, expenditures, debt management, and other political/economic and management factors.\nAnalysis on Third-Party Government and the Nonprofit Sector: Analyzed and presented features of the U.S. nonprofit sector; explained essential governance and management functions of nonprofits","projects":"Data Analysis Research: Analyzed data about public and the private sectors using SPSS software. Generated research questions and developed investigative strategies to explain political phenomenon. Constructed tables and graphics that summarized aggregated data, illustrated variation, and drew inferences from samples to populations.\nBudgeting and Finance Project: Analyzed and presented State and municipal governmental budgets with special emphasis on reforms, processes, revenues, expenditures, debt management, and other political/economic and management factors.\nAnalysis on Third-Party Government and the Nonprofit Sector: Analyzed and presented features of the U.S. nonprofit sector; explained essential governance and management functions of nonprofits"}