{"name":"Yixin Chi","email":"yxchi@gwu.edu","phone":"(202)999-5945","summary":"– 5 years hands-on experiences in large scale, high volume transaction payment systems development.","education":"The George Washington University September 2015 - May 2017\nMaster of Science in Computer Science DC, USA\nHarbin Engineering University September 2006 - July 2010\nBachelor of Management in E-Commerce Harbin, China","experience":"Alipay.com (Alibaba Group), Senior Software Engineer June 2013 - May 2015\n3rd Architecture Project - Java,Oracle,MySQL\n– Designed and implemented the new payment platform of Alipay.com,which processing 80 million\ntransactions per day.\n– Designed and built the clearing center of Alipay.com, which is responsible for reconciliation with the banks\nand enterprises.\nPerformance and Failover Project - Java,Oracle\n– Used database sharding and cache, optimized transaction and business, to meet the payment with\n1.5w/second.\n– Designed and created a failover solution with DBA, making system has fault-tolerant,which particularly\nimportant to a huge payment company. It already used more than three times.\nAlipay.com (Alibaba Group), Software Engineer July 2010 - May 2013\nAccounting Center Project - Java,Oracle\n– Designed and implemented the accounting center.When completed, it became the best system of annual in\ncompany because of its scalability and test coverage.\nPayment Database sharding Project - Java,Oracle\n– Implemented the rst database sharding project in Alipay.com, splitting in 3 databases and 100 tables. This\nis rst attempt to put the core nancial system's database on the PC server.","honors":"On the job July 2010 - May 2015\n– Individual Award for Unique Design of Technique Department\n– Most Excellent Team Award at the whole Technique Department\n– Champion of Alibaba Football Match on behalf of Alipay\nAcademic September 2006 - July 2010\n– Schools First-class Scholarship and Second-class Scholarship once respectively and Third-class Scholarship\nfour times\n– First Prize of Heilongjiang Multi-media Courseware Competition\n– Third Prize of Schools Mathematics Contest"}