{"name":"Yi Zhang","email":"zhangyi1@gwmail.gwu.edu","phone":"(571) 317-8082","education":"George Washington University, School of Engineering and Applied Science Washington, DC\nMaster of Science in Engineering, Computer Science May 2017\nRelevant Coursework: Computer Network, Software Paradigm, Computer Architecture, Algorithm\nSichuan University of China Chengdu, China\nBachelor of Science in Engineering, Computer Science and Technology June 2015\nSichuan University ranked among the top 10 universities in China","experience":"Screen lock word learning system based on Android, Sichuan University of China China\nLead Researcher December 2013 – December 2014\nManaged a word learning system that is featured by setting the object word as the password to unlock the screen aiming to\nachieve the purpose of memorizing words based on Android.\nLet team 5 members and delegated work, then made APP 95% success to be produced accurately.\nA graduate enrollment management system based on J2EE, Sichuan University of China China\nTeam member May 2013 - February 2014\nDesigned an enrollment management system that services the day-to-day management of the Graduate Admissions Office. Assisted\nthe formulation of the admission scheme, making directory of professional students.\nProcessed information related to preliminary and second examinations.\nA small library management system China\nLead Researcher October 2013 - November 2013\nManaged a small library management system that can provide services of quarry, adding editing information, tracking books\ncirculation information and the basic information of readers.\nA management information system of students' performance China\nTeam member September 2013\nDeveloped a system that aims to manage information of students' performance more effectively, including\ninputting, querying, modifying basic information and achievement on students.\nLEADERSHIP\nDeputy Secretary of the Communist Youth League of college\nFor example, I organized an employment lecture for at least 300 students Sept 2013 – May 2014\nMinister of the Organization of college\nFor instance, I have managed the Welcome Party for the Freshmen 3 times in the school Sept 2012 – May 2013","awards":"The first scholarship individual of Sichuan University\nExcellent prize in Imagine Cup(a challenge match designing and developing APP for Microsoft)\nTop Ten deputy secretary of the Communist Youth League of college\nExcellent Student of Sichuan University\nTop Ten Ministers of the organization of college\nExcellent Works of Volunteer Activities for the Country People (because of participating 20+\nvolunteer activities every year)","honors":"& AWARDS\nThe first scholarship individual of Sichuan University\nExcellent prize in Imagine Cup(a challenge match designing and developing APP for Microsoft)\nTop Ten deputy secretary of the Communist Youth League of college\nExcellent Student of Sichuan University\nTop Ten Ministers of the organization of college\nExcellent Works of Volunteer Activities for the Country People (because of participating 20+\nvolunteer activities every year)","skills":"Programming Language: Java, C++\nApplications: Microsoft Office Sets, Microsoft Visual Studio, Eclipse, Adobe Photoshop, Adobe After Effects\nOperating Systems: Windows\nLanguage: Fluent in Chinese, Proficient in English"}