{"name":"Jiaxing Zheng","email":"zjx2029799@gmail.com","education":"George Washington University - DC, USA May 2018\nMaster of Computer Science","experience":"Software Engineer Intern, Neusoft., Tianjin City, China Jun 2016 — April 2016\nCollaborated with the IT teams to update its current front pages with html5 using many powerful Jquery and CSS to reduce\ntheir background codes and improve its robust of certain functions.\nDeveloped our team management system's foreground pages using Jsp technique.\nApplied SpringMVC framework and Hibernate to our team management system and improved its pages' style by\nbootstrap's CSS.\nSoftware Engineer Intern, DHC SOFTWARE CO, LTD., Taiyuan City, China July 2015 — Sept 2015\nBuilt the front page of a transport company's program using C#\nMastered background database maintenance of SQLServer\nSet up the company's network training laboratory with 48 computers and six Cabinets that each has several routers and switches.","projects":"Full Stack & Highly Scalable URL Shortener Service Jun 2016 — Aug 2016\nDeveloped a full stack web app using the MEAN stack (MongoDB, Express, AngularJS and Node.js) to deliver TinyURL\nlike URL shortening service.\nImproved Web App performance and scalability by implementing Redis cache layer, Nginx reverse proxy/load balancer,\nand Dockerized server code.\nMigrated original MongoDB store to Apache Cassandra's distributed storage system as warehouse size grew into multiple\nTB of data.\nFull Stack Web Application With SpringMVC for an online study system April 2016 — May 2016\nDeveloped a full stack Web Program using SSH framework(SpringMVC, Spring, Hibernate) and the stack(JSP, HTML, bootstrap,\nOracle Database and JavaScript ) to design an online study source sharing System.\nAccumulating the data from the students when they register and download any files and make an analysis of these data to\nshow the priority of the resources.\nNormalized this system as a useful tool for my school in Shanxi University to allow the teachers and students share files\nlike the Black Board's function in many University of America.\nThe Testing Program on Data Mining Algorithm Feb 2015 — May 2015\nFacilitated MATLAB to simulate experiments of academic papers to find valuable information for our academic dissertation.\nConnected Visual Studio (language C#) with MATLAB by citing algorithms on Visual Studio to exhibit experimental results.\nDesigned an individual project using the results from the research that my professor make use of, to conveniently compare the\nexecution of algorithms' results.","skills":"Programming: Java ・ Python ・ JavaScript ・ Shell Scripting ・ SQL ・ C++・ C#・ prolog ・ Lisp\nCloud Computing: Apache Kafka ・ Apache Cassandra\nWeb Development: Node.js ・ Angular.js ・ jQuery ・ Express.js ・ HTML ・ JSP ・ Bootstrap\nDatabase: MySQL ・ MongoDB ・ SQLServer ・ Redis ・ Oracle\nComputer System and Network Security: Red Hat linux certificate(RHCE)・ Cisco certificate (CCNA)\nEXTRACURRICULAR ACTIVITIES\n2014 Chinese Spring Festival Railway Transportation Volunteer Jan 2014 — Feb 2014\nOffer information consultation for the passengers.\nHelped Disadvantaged persons transfer luggage, assisted station workers in maintaining order and regulations.\nFirst Vice President in Student Union of the university school Sept 2014 — Oct 2015\nCreate a team specialized in computer maintenance to help community members master some basic computer skills and fixed\ncomputers around 300-400.\nOrganized several seminars, and activities inviting scholars and practitioners to help students achieve academic and career goals."}