{"name":"Xian Cui","email":"xiancui@gwu.edu","phone":"217-418-7589","education":"THE GEORGE WASHINGTON UNIVERSITY, School of Business Washington, DC\nMaster of Science in Information Systems Technology GPA: 3.9/4.0 Dec 2016\nUNIVERSITY OF ILLINOIS AT URBANA-CHAMPAIGN, School of Labor and Employment Relations Champaign,IL\nMaster of Human Resources and Industrial Relations GPA: 3.94/4.0 Dec 2013\nBEIJING NORMAL UNIVERSITY, School of Management Beijing, China\nBachelor of Management in Human Resource Management, GPA: 88.6/100, Ranking: 2/52 July 2011\nDouble Bachelor of Arts in English, GPA: 88.4/100 July 2011\nTECHNICAL SKILLS\nKnowledge: SDLC, RDBMS, Data Warehousing, OLAP, LAMP stack, MVC, GUI design, UML, Amazon EC2 Cloud Services","skills":"Knowledge: SDLC, RDBMS, Data Warehousing, OLAP, LAMP stack, MVC, GUI design, UML, Amazon EC2 Cloud Services","projects":"Recipe Club\nWebsite: http://ec2-54-209-23-12.compute-1.amazonaws.com/project2/user_input.php\nRecipe Club is a web application that is able to validate user input with JavaScript and PHP, as well as store, retrieve, update and\ndelete items in a database. The application is uploaded to a cloud computing platform using Amazon EC2 cloud services.\nApplied Technology: HTML5, CSS3, JavaScript, PHP, MySQL, Responsive Design, Semantic markup, Amazon EC2 cloud\nservices, MVC framework, LAMP stack\nBMI Data Management System\nThe BMI data management system is a GUI-based software package that can help user calculate body conditions based on multiple\ninputs, import/export data from/into excel spreadsheet.\nApplied Technology: Python for back-end programming, Qt Designer for GUI design, User input validation\nMotors Sales Tracking Database\nA database application created from ERD to assist sales associates with tracking the dealership's sales data. The database captures\ninformation about customers, orders, inventory, sales associate, manufacturer, vehicle, and order. Created queries and reports from\nthe database.\nApplied Technology: Amazon RDS service, MySQL, ERDplus, Relational Database, Conceptual & Logical & Physical Design","experience":"CORNERSTONE INTERNATIONAL EDUCATIONAL CONSULTING INC Chicago, IL\nTraining Project Assistant Apr – Dec 2014\nManaged training data; designed and implemented students' training plan\nQuantitatively analyzed and evaluated students' training effect\nUNIVERSITY OF ILLINOIS AT URBANA-CHAMPAIGN Champaign, IL\nResearch Assistant (Data Analyst) Sep 2012–Jan 2013\nAnalyzed more than 4000 samples from 31 provinces in China by SPSS\nExplored relations by testing suitable analytical methods including linear regression and logistic regression\nResearched, reviewed, classified and summarized relevant literature\nDELPHI PACKARD ELECTRIC SYSTEMS CORPORATION Changchun, China\nHR Data Management Intern Jun –Aug 2012\nAssisted in training data collection, sorting and maintenance; processed labor contract data for over 100 new operators per week\nCo-organized and conducted written exam and interview for nearly 200 operator candidates every week; recruiting data summary\nCoordinated meeting, arranged group meetings, summarized working plan for the following week\nFAW JIEFANG AUTOMOTIVE CORPORATION Changchun, China\nHR Analyst Intern Jul–Dec 2011\nDesigned demand questionnaire, evaluated training effect qualitatively and quantitatively, compiled training program report\nDelivered over 200 questionnaires, integrated training demands from employees and department directors, incorporated strategy\nand benchmarked market practices\nSINOSTEEL CORPORATION Beijing, China\nHR Analyst Intern Mar–Jun 2011\nDesigned, collected and analyzed employee satisfaction survey by SPSS, and explored key metrics for retention rate\nCo-organized written exam, co-interviewed 30 candidates, evaluated written and interview weighted total scores in Excel","additional":"INFORMATION\nCHINESE BUSINESS STUDENTS & ALUMNI ASSOCIATION Champaign, IL\nVice President of HR Jul -Dec2013\nDesigned Organizational structure; recruited new members based on organizational needs; promoted events to students, arranged\nmember get-together events"}