{"name":"Ruoyan Qin","email":"rq25@cornell.edu","phone":"14853\n60726","courses":"Object-Oriented Programming and Data Structures , Discrete Structures , Nano Fabrication ,\nComputer Networks (online) , Web application architecture(online) , Computer System Organization\nand Programming , Database Systems , Computer Vision , Theory of Computing , Information\nRetrieval\nRELATED","experience":"Programmer, Web Administrator 2015-Present\nLet's Get Coffee, Ithaca, NY, letsgetcoffeecornell.com\nDeveloped and tested python/Django application for collecting and processing survey data.\nImplemented admin interface for non-technical client to view and manage postgresql database\nEnriched user mobile experience by integrating bootstrap, automatic form rendering behavior and\ncustom javascript and css\nMaintained database and implemented functionalities based on user request. Managed repository\nwith Git\nPresented analytics data to executive board for improving marketing strategy\nProgrammer, Web Developer 2016-Present\nIvy Education Consulting, New York, U.S., Zhengzhou, China, ivyguideamerica.com\nCreated multilingual business website with python/django, html/css and javascript.\nImplemented multilingual functionality with django internationalization modules\nOrganized page content based on user request\nProgrammer Fall 2015\nNano Fabrication ENGRI 1820\nCreated Internet of Things application tracking traffic in a building for course final project.\nBuilt hardware part with Arduino, ultrasonic, infrared sensors and wifi-shield to send data by http\nGET requests to our own server\nProgrammed web interface processing and displaying data on django website.\nTested project in real world setting and did presentation to class\nProgrammer Spring 2013\nFIRST Robotics\nWorked with mentors and other programmers to program robot behavior in autonomous mode\nProgrammed with C++, visual basic and WPI library.\nCreated 3D animation competition video using 3ds Max.\nSPECIALIZEDCS2800 Teaching Assistant, Discrete Structures (core cs course), Cornell University. Spring 2016\nPublicity Chair, Society of Women Engineers, Cornell. 2015-Present\nTutor Program Director, Ivy Education Consulting. 2015-Present\nFinancial Statements Translation, Henan Zhongzhou Transport Co., Ltd., China. Summer 2015","skills":"Programming Languages: C, C++, Java, SQL, Python, R, Matlab, Scala\nWeb Development: HTML, CSS, JavaScript, Django, bootstrap\nMachine Learning: numpy, pandas, scipy\nOther topics: information retrieval, computer vision algorithms, LaTex, TDD, linux/unix commands &\nscripting\nOTHER"}