{"name":"D A","email":"daj@davidandrewjohnson.com","phone":"(571) 529-0372","experience":"Enterprise Portfolio Owner, Customer Digital Experience, Fannie Mae (2016-2017)\nDirect teams of UX designers, content strategists, creative directors, UI designers, and front end\nand back end engineers in an enterprise portfolio of tier zero applications and digital products\nworth tens of billions of dollars in annual revenue.\nLead enterprise customer experience strategy, integration and design for Salesforce and Content\nManagement Systems, coordinating a cross functional team of business analysts, developers,\narchitects, and designers representing dozens of stakeholders and business units.\nEvangelist for Design Thinking and Agile/LEAN methodology. Conduct seminars and workshops\nfor executive stakeholders, business owners, and customers. Mentor and coach junior staff.\nHead of Marketing and Communications Digital Strategy, Fannie Mae (2015-2016)\nDeveloped, launched and managed B2B and B2C content marketing and brand publishing efforts\nto increase industry engagement in and brand reputation. Launched products and campaigns\naround millennial housing needs, affordable housing, and disenfranchised communities.\nAs editor in chief, recruited and managed a dozen multimedia content creators, freelancers, and\nvendors.\nWorked to establish social media presence and craft content strategy for key audiences.\nWorked with agencies and internal teams in a major brand refresh and develop a new messaging\nframework and visual communication system.\nRedesigned and replatformed FannieMae.com, from sprint zero to launch ready in 6 months, 6\nfigures under budget. Created new workflows and back-end tools for content production resulting\nin 7-figure labor cost savings. Revamped taxonomy and IA for implicit personalization journeys\nto a customer conversion funnel.\nCreated company's first universal visual design language and style guide for web and digital\napplications. Owner of company editorial style guide.\n(571) 529-0372 www.davidandrewjohnson.com daj@davidandrewjohnson.com\n2\nDeveloped marketing insights and marketing automation strategies to target audiences for\npersonalized and predictive messaging based upon customer data and analytics, checked against\nindustry statistics and design best practices.\nLed journey mapping and development of customer profiles for product redesigns and business\ninnovation for a unified portal experience, designed to transition low touch, high volume\ncustomer interactions to self-service.\nTrained communications and public relations teams in journalistic writing, SEO and effective\nmethods in media outreach in the changing digital space.\nDeveloped internal and external communications and marketing plans and go-to-market strategies\nfor new products and services.\nWorked with internal innovation incubators to reach goals of marketing automation, CRM and\nCMS integration and an omnichannel mobile-first experience.\nPrincipal, Sextant Media (2006-2015)\nLed client bidding and proposals, managed client relationships to grow business and revenue.\nDesigned, developed and managed a portfolio of client web sites in various platforms, tailored to\nspecific client needs and capabilities.\nCreated and carried out content marketing and digital strategies for businesses, non-profits and\ntrade associations.\nConsulted in mobile development and business transition across full customer journey.\nConsulted in open and big data projects for major organizations as technical and content advisor.\nCreated branding strategies, creative direction and graphic design for multimedia, broadcast, print\nand digital.\nDeveloped and consulted in strategic communications plans, audience engagement, social media\nstrategies and digital training for major media companies.\nDesigned and developed e-mail marketing campaigns and newsletters.\nDesigned, edited and published membership and outreach magazines for non-profit associations.\nCoached public speakers, wrote speeches and ghost wrote placed articles in industry publications.\nManaged advertising, media and public relations for local and national projects in digital and\ntraditional platforms.\nProfessor, American University School of Communication (2007-2013)\nDual appointment in Journalism & Public Affairs and Film & Media Arts faculties.\nTaught graduate-level courses in web design, UX/UI/IA, prototyping and wireframing, editing\nand writing, advanced multimedia, visual storytelling, interactive design, serious games, and\nsocial media. Digital skills taught included Photoshop, Illustrator, Indesign, Final Cut, Audition,\nHTML, CSS, JavaScript, PHP, Python.\nPartnered to create cutting edge projects with publishers including USA Today, The Washington\nPost, CBS, NPR and NBC among others.\nEditor-in-Chief and Webmaster of \"The American Observer.\" Chair of technology committee.\nMember university committees for web redesign of American.edu, curriculum reform, and\nbuilding/facilities.\nPiloted efforts in online teaching and distance education. Evaluated and tested online webcasting\nsoftware and courseware for user experience and usability.\nVice Chair, New Media Committee; member Broadcast Committee, National Press Club.\nPublic speaker and innovation evangelist at TED events and industry conferences.\nPopular and often-quoted media expert in print and television, blogger at huffingtonpost.com,\nmediashift.com, poynter.org, lostremote.com, and charter member Media Bloggers Association.\n(571) 529-0372 www.davidandrewjohnson.com daj@davidandrewjohnson.com\n3\nChief Technology Officer, Scripps Media Center (2001-2007)\nLed technology, new media innovation, and all Internet products, including launching and\ndirecting a public-facing Web 2.0 community site and blog network that aggregated and curated\ncontent from all properties enterprise-wide – 30 newspapers, 13 broadcast stations, HGTV, Food,\n& DIY vertical networks.\nDeveloped business plans, editorial strategy, design, and directed the launch of \"HGTV Ideas\"\nmagazine as a zoned newspaper insert, resulting in millions of dollars in new net revenue through\ntargeted distribution by income and zipcodes.\nEstablished custom publishing (advertorial and multichannel content marketing) business unit.\nLed synergy and convergence content strategy for enterprise, pushing content into new social\nchannels and multimedia.\nDirected enterprise-level projects to develop digital asset management and syndication systems\nfor Scripps newspaper division.\nWorked with executive management in business development and strategy.\nEditor, Online Publishing Update, Newspaper Association of America.\nWon Phillip Meyer Award for Investigative Journalism as producer of \"Saving Babies.\"\nExecutive Producer and Online Editor, Scripps Treasure Coast Publishing (1998-2000)\nManaged all editorial and advertising content overseeing design, development and production for\na portal site representing 7 newspapers and two local television stations.\nDeveloped custom live-streaming media solutions, dynamic news wire products, and other\nspecialized content applications including ecommerce and verticals.\nDrove millions of page views directing major productions for newspaper and broadcast sites\nincluding the Starr report, space shuttle launches, spring training baseball, Super Bowls, natural\ndisasters including hurricanes and wild fires among other events.\nCreated and co-hosted \"Fighting Monday,\" a pioneering streaming interactive Webcast program.\nWinner of multiple awards, including NAA Digital Edge Award for Best Online News Site.\nDirector of Communication, Institute of Maritime History (1997-1998)\nDesigned, edited and published membership magazine.\nDesigned, developed and maintained award-winning Web site. Ran the first \"virtual shipwreck\nproject,\" with a live site updated daily from the field during a 1997 survey.\nDirector & Executive Producer, Last Minute Productions (1994-1996)\nWrote, directed and produced audio theater programs for NPR and community radio.\nVoice talent for commercials and other programming.\nStudio producer and engineer for music projects and foley.","education":"American University: Doctoral studies in Anthropology and Communication (ABD)\nGeorgetown University: Graduate Certificate in Business Administration and Marketing\nTexas A&M University: M.A. Anthropology (Nautical Archaeology), Summa Cum Laude\nIndiana University: B.A. Anthropology with Honors\nPurdue University: Graphic Design and Fine Arts"}