{"name":"Present The","email":"yasmeenschuller@gmail.com","phone":"312-315-9964","experience":"2014 – Present The Chainlink\nPresident\nResponsibilities:\nOnline cycling community with over 500,000 targeted website visitors. Facebook followers increased by 395% in two years, Twitter followers increased 210% in two years, and launched Instagram, growing the following over 176% in the last year.\nManaging editor of weekly content for website including articles, forum, social media, and calendar of events. Contributing writer including articles, forum, social media, and calendar of events.\nRecently ranked #31 for Feedspot's Top 100 Cycling Blogs (global ranking)\nHead of a one-stop online resource for cyclists including a forum, calendar of cycling-related events, cycling-related news and articles\nExecutive sales: responsible for selling advertising, articles, bike valet, and promotional events\nSocial Media and Digital Marketing content creation and continuous improvement to promote the site, events, and features\nOversee all Chainlink hosted events and promotion of local cycling-related events\nOversee all operations for the site – technical, marketing, creative, sales, and content\n2017 – 2018 Gartner Digital Markets\nSocial Media Manager\nResponsibilities:\nLead social media at Capterra, a Gartner Digital Markets brand including managing three direct reports.\nResponsible for growing audience and engagement for social media presence. In three months, grew audience by 52% and engagement by 53%.\nManage a team of three social media specialists responsible for managing campaigns, growing engagement and followers, and executing overall social media strategy.\nDeveloped a 12-month strategy and plan with objectives, campaigns, and tactical activities to continue to grow the social media audience, engagement, and website traffic.\n2013 – 2015 Generation Brands – Mount Prospect, Illinois\nDirector of Digital Marketing\nResponsibilities:\nSuccessful redesign of websites for LBL Lighting, Feiss, and Sea Gull. Redesigns improved overall design, usability, product information, site navigation and SEO. Successful launch of new site for GATICA lighting systems.\nOversee all social media activity on Pinterest, Houzz, Facebook, Twitter, and LinkedIn with a focus on building audience, engagement, and directing traffic back to the website to find a showroom or eCommerce retailer to purchase.\nWork closely with the eCommerce team to support eCommerce retailers to improve sales and visibility for all of Generation Brands.\nManage a team including developers and social media.\nDevelop and oversee the digital marketing strategy for all of the brands.\n2012 – 2013 Cummins Allison – Mount Prospect, Illinois\nSenior Digital Marketing Manager\nResponsibilities:\nManage analytics using Google Analytics to monitor and manage SEO, SEM, digital campaigns, and lead generation.\nOversaw website redesign including the implementation of a product comparison tool, enhanced product pages, mobile site, and search engine optimized content.\nManage the Lead Generation (custom CRM tool), eCommerce and Intranet projects including planning, design, and development.\nOptimize website content for SEO and develop content for new sections. Improving ranking and organic traffic for websites.\n2011 - 2012 Digital Innovations – Arlington Heights, Illinois\nDirector of Marketing\nResponsibilities:\nLed Digital Innovations rebranding project including logo, messaging and creative changes implemented on packaging, digital properties and marketing collateral. Rebranding brought an increase in placement for retailers including BestBuy, Staples and GameStop.\nLaunched Android Speaker Dock at the Consumer Electronics Show in Las Vegas (January, 2012) at the ShowStoppers press event.\nDeveloped marketing strategy and implementation plan including traditional, digital, and social platforms. Oversee creative execution of plan, including managing content, design resources and developers.\nManage social media, digital marketing and website presence including content, promotional campaigns and advertising. Successful campaigns include a Holiday Military Family Giveaway, webcam educational campaign, and a Holiday Promotion with weekly spotlight products and special discounts for fans and subscribers.\nIncreased online sales by 35% in 6 months and website traffic by 25%. Moved the online store to Amazon for increased exposure and improved SEO.\nIncreased Facebook fans by over 21,000 in less than 6 months.\nManagement responsibilities include public relations and event marketing encompassing product launches and the Consumer Electronics Show (January, 2012).\n2006 - 2011 DeVry - Becker Professional Education – Downers Grove, Illinois\nManager, Digital Marketing\nResponsibilities:\nOversaw the organization's digital marketing and social media efforts including strategy, planning, and execution. Social media platforms included Facebook, LinkedIn, Twitter, and YouTube. Brought Becker Professional Education's social presence to a combined fan base of over 24,000.\nManaged paid search annual budget of over $1 million, made improvements that led to a revenue increase of over $1 million per month. Successfully launched and managed behavioral and retargeting campaigns.\nDigital Marketing related revenue in May, 2011 increased by 74% year over year to over $1 million in one month.\nManaged social media advertising, promotional events, and launch of additional social media platforms. Advertising and Facebook events resulted in a quickly growing and engaged fan base driving website traffic and revenue.\nManaged a team, planning and executing all of the digital activity for Becker.com and Stalla.com with digital marketing-related activities increasing revenue leveraging email, banners, SEO, SEM, topic-based ads, retargeting ads, and social media.\nParticipated on DeVry's Social Media Center of Excellence teams including training, collaboration, listening, and lead monthly lunch and learn sessions.\nManaged digital marketing e.g. promotional emails, landing pages, electronic branding, search engine optimization, and Flash banners.\nWork closely with CRM (RightNow), working with a team on optimizing leads, creating email campaigns, and addressing rules for the email lists.\nOversaw several CMS implementations including Hannon Hill's Cascade and DotNetNuke.\n2001-2006 Harper College - Palatine, Illinois\nManager of Strategic Applications, Web Resources\nManaged web development team responsible for developing and implementing web applications for internal and external use including Oracle Portal, Web Registration and Payment, Java-based course searches, and Web Grade Inquiry.\nDeveloped and delivered presentations, usability testing, and training seminars for a wide audience varying from high level executives and board members to IT professionals and faculty members.\nDetermined web technology strategy for the college.\n1999 - 2001 Oracle - Chicago, Illinois\nPrincipal Consultant - eCommerce, Advanced Technologies\nManaged consulting team in North Central Advance Technologies group.\nProject manage successful e-commerce and portal solutions for various clients using Oracle iStore and Oracle Portal applications with project management methodologies\nManage e-commerce development teams to meet client deliverables for e-commerce solutions, custom solutions, prototypes, and website production.\nReview websites for ease of use and review usability fundamentals with clients to facilitate site-wide improvements.","education":"B.A. English, Communication Minor with honors\nNortheastern Illinois University, Chicago, Illinois\nYasmeen Schuller\nHYPERLINK \"http://yasmeenschuller.wordpress.com/\" \\t \"_blank\" yasmeenschuller.wordpress.com\nHYPERLINK \"mailto:yasmeenschuller@gmail.com\" yasmeenschuller@gmail.com\nChicago, Illinois\n312-315-9964\nYasmeen Schuller\nHYPERLINK \"mailto:yasmeenschuller@gmail.com\" yasmeenschuller@gmail.com\nWashington, D.C.\n312-315-9964"}