{"name":"Yixin Chi","email":"yxchi@gwu.edu","phone":"(202)999-5945","profiles":"https://github.com/kingauthur","summary":"– Senior software engineer with 5 years experiences in large scale, high volume transaction payment systems\ndevelopment with Java. Experienced the evolution of architecture from SOA to distributed architecture,best\npractices of continuous availability and high performance.\n– Hands-on 1 year experiences in Python with scienti c computation and machine learning, familiar with\nNumPy, Numba, VisPy, PyTorch and scikit-learn. Has basic knowledge of Neural Networks.\n– Hands-on building a hybrid app, familiar with JavaScript and AngularJS.","education":"The George Washington University September 2015 - May 2017\nMaster of Science in Computer Science DC, USA\nHarbin Engineering University September 2006 - July 2010\nBachelor of Management in E-Commerce Harbin, China","experience":"Harris Lab (APIG)/Janelia., Internship Jan 2017 - May 2017\nSpikeSorting App - Python, NumPy, VisPy, Numba, scikit-learn\n– Designed and implemented a event-driven, rich interaction, low latency and high extensible SpikeSorting\nApp by Python. Compared to traditional SpikeSorting App, it gives users chances to interact with big data\nin di erent feature space simultaneously and smoothly. It is also easily integrate with Jupyter and take\nadvantage of it.\n– Learned machine learning algorithm to make sorting more accuracy and faster. The next step is try to apply\nmetric learning to improve the performance by taking advantage of rich interaction.\nProject Dream Miles, Inc., Internship June 2016 - Aug 2016\nHybrid App - AngularJS,MongoDB\n– Designed and implemented the hybrid app by ionic platform, including integrate with facebook login and\nStripe.com. Because it is a startup, and it base on this app, so almost participated in all processes.\nAlipay.com (Alibaba Group), Senior Software Engineer June 2013 - May 2015\n3rd Architecture Project - Java,Oracle,MySQL\n– Designed and implemented the new payment platform of Alipay.com,which processing 80 million\ntransactions per day.\n– Designed and built the clearing center of Alipay.com, which is responsible for reconciliation with the banks\nand enterprises.\nPerformance and Failover Project - Java,Oracle\n– Used database sharding and cache, optimized transaction and business, to meet the payment with\n1.5w/second.\n– Designed and created a failover solution with DBA, making system has fault-tolerant,which particularly\nimportant to a huge payment company. It already used more than three times.\nAlipay.com (Alibaba Group), Software Engineer July 2010 - May 2013\nAccounting Center Project - Java,Oracle\n– Designed and implemented the accounting center.When completed, it became the best system of annual in\ncompany because of its scalability and test coverage.\nPayment Database sharding Project - Java,Oracle\n– Implemented the rst database sharding project in Alipay.com, splitting in 3 databases and 100 tables. This\nis rst attempt to put the core nancial system's database on the PC server.","github":{}}