{"name":"Zhaojun Yang","email":"zyang7@wpi.edu","phone":"(617) 697-8515","education":"Worcester Polytechnic Institute (WPI), Worcester, Massachusetts, USA\nMaster of Science in Computer Science, GPA: 3.71 Sep 2015 – Expected May 2017\nBeijing University of Posts and Telecommunications (BUPT), Beijing, China\nBachelor of Engineering in Communication Engineering, GPA: 3.70 Sep 2011 – Jul 2015","skills":"Programming Languages: Java, JavaScript, HTML, CSS, Python, Ruby, PHP\nOperating Systems: Windows, Linux, OS X\nTools: Git, Android Studio\nDatabase Related: MySQL, JDBC\nWeb Technologies: jQuery, Node.js, React.js, Bootstrap, Express 4.0, Rails 5, gulp, webpack, Ajax\nOther Skills: MVC design, Agile methodology, Android development, D3.js","experience":"State Key Laboratory of Networking and Switching Technology, BUPT\nResearch Assistant, July 2014 – May 2015\nStudied user communication behavior and link prediction algorithms.\nImplemented various link prediction algorithms using Python and MATLAB.\nPublished paper A Community-Structure Based Adaptively Optimized Link Prediction Algorithm.","projects":"WPI Route Finder (Java, MySQL) Sep 2015 – Dec 2015\nDesigned and implemented a mapping application that helps user to find the shortest route between two locations\nin WPI using Java following Object Oriented Design principle in a team of seven.\nDesigned and implemented GUI using Java Swing in a team of two.\nImplemented various features including smart search module, parking lot framework, etc. to increase usability.\nBuilt MySQL database to facilitate data input and retrieval.\nEmployed strategy design pattern to support three different path-finding algorithms (Dijkstra's algorithm,\nA* algorithm and a multi-destination routing algorithm).\nWeb Application: Workout (React.js, webpack, Express) Mar 2016 – Apr 2016\nBuilt a single page workout web application using React.js.\nApplied React Router to keep UI in sync with the URL.\nEnabled ES6 features for front-end code by babel and used gulp to automate the development workflow. Utilized\nwebpack as a module bundler.\nImplemented back-end logic on Express 4.0 server to allow users to customize their workout schedules and get\nworkout related information.\nWeb Application: Microblog (Ruby on Rails) May 2016 – Jun 2016\nImplemented a microblogging web application that has users, microposts, and a full log in and authentication\nframework using Ruby on Rails.\nWrote controller tests, model tests and integration tests to protect against regressions and facilitate code\nrefactoring.\nApplied the REST architecture to model application components such as users and microposts, etc.\nClient-Server Chat Application (Java, Multithreading) Jun 2016 – Jun 2016\nImplemented a chat program based on the client-server model using Java sockets.\nBuilt a multi-threaded server that could handle multiple clients input.\nImplemented GUI using Java Swing."}