{"name":"O J","email":"zihaojing.11@berkeley.edu","education":"University of California, Berkeley Fall 2012 Fall 2015\nB.A Applied Mathematics and Computer Science Minor\nCS: Data Structures, Algorithms, Artificial Intelligence, Machine Learning, Operating Systems, Computer Networking.\nMath & Stat: Real Analysis, Complex Analysis, Mathematical Cryptography, Numerical Analysis, Linear Algebra, Abstract Algebra, Probability\nEcon : International Economics, Intermediate Microeconomics, Intermediate Macroeconomics, Game Theory\nThe Ohio State University, Columbus Fall 2011 Spring 2012\nEMPLOYMENT\nUniversity of California, Berkeley Math Department,\nGrader\n, Berkeley, CA Jul 2016 Dec 2016\nGraded weekly homework and quizzes and provided constructive feedback along with solutions for Numerical Analysis.\nTutored students to help them retain information and improve both grades and overall performance in Math.\nPROGRAMMING LANGAUGES: Python(NumPy /SciPy /Pandas /Scikit), Java, Matlab, C++, C, Scheme, Javascript, HTML, CSS, Ruby\nTOOLS: Git, LaTeX, Eclipse, GDB, GCC, JUnit Testing, Unix Shell, MapReduce","projects":"Chat Server and Http Server (Python)\nBuilt a Chat Server allow users to converse in different channels and users can create and join channels.\nUse Python Select, Socket, and Sys Library to implement a Server can handle Join , Create , List messages from Clients.\nCreated a HTTP server that handles HTTP GET requests. Provided functionality through the use of HTTP response headers .\nAdded support for HTTP error codes, created directory listings with HTML, and created a HTTP proxy.\nGitlet (Java)\nWrote and designed a version control system mimics some of the basic features of the popular version control system git.\nSupported functionalities such as: backup system for files, Restoring a backup version, Viewing the history of backups.\nAllow users to use Init, Rebase, Branch, Checkout, Commit, Merge, Log in the Gitlet.\nMachine Learning Course Project (Python)\nCreate a visualization of restaurant ratings using machine learning algorithm and the Yelp academic dataset.\nImplemented Neural Network, SVMs, Random Forest for Spam Detection and Image Recognition using Numpy, Scipy.\nApplied and explored algorithms such as: PCA, SVD, Logistic Regression, Ada-Boost algorithm, Gradient Descent, and the Back\nPropagation in MNIST data set and Matplotlib to Visualize cluster centers.\nPacman Game Agent (Python)\nImplemented Pacman AI using DFS/BFS, uniform cost and A* search with minimax algorithm.\nCoded model-based and model-free reinforcement learning algorithms to simulate crawling robot, and probabilistic inference in a\nHidden Markov Model using Forward Algorithm and approximate inference via Particle Filters.\nExperimented multi agent Minimax and Expectimax algorithms, as well as designing evaluation functions.\nImplement Pintos Operating System (C)\nWorked in a team of 4 students to implement an educational operating system Pintos in C.\nAdded Efficient Alarm Clock, Priority Scheduling, and BSD Scheduler. I wrote Priority Donation for Locks.\nSupported user programs by implementing Argument Passing, User Memory Access and System Calls.\nMade memory allocator from scratch and exposed to POSIX interfaces, reasoned about memory","awards":"Dean's list : for student with GPA 3.5 or higher,\nOhio State University\nCERTIFICATE\nAlgorithm Design Analysis Coursera\nUsing Python to Access Web Data Coursera\nUsing Databases with Python Coursera"}